class QuestionModel {
  late final int? no;
  late final String? question;
  late final List<String>? choice;
  late final int? correctAnswer;

  QuestionModel({
    this.no,
    this.question,
    this.choice,
    this.correctAnswer,
  });
}

class Question {
  static final getQuestionList = [
    QuestionModel(
      no: 1,
      question: '1 + 1 = ?',
      choice: ['1', '2', '3', '4', '5'],
      correctAnswer: 2,
    ),
    QuestionModel(
      no: 2,
      question:
          'ตัวอย่างคำถาม ตัวอย่างคำถาม ตัวอย่างคำถาม ตัวอย่างคำถาม ตัวอย่างคำถาม ตัวอย่างคำถาม ตัวอย่างคำถาม ตัวอย่างคำถาม ตัวอย่างคำถาม ตัวอย่างคำถาม ?',
      choice: [
        'ตัวอย่างตัวเลือก 1 ตัวอย่างตัวเลือก 1 ตัวอย่างตัวเลือก 1 ตัวอย่างตัวเลือก 1 ตัวอย่างตัวเลือก 1',
        'ตัวอย่างตัวเลือก 2 ตัวอย่างตัวเลือก 2 ตัวอย่างตัวเลือก 2 ตัวอย่างตัวเลือก 2 ตัวอย่างตัวเลือก 2',
        'ตัวอย่างตัวเลือก 3 ตัวอย่างตัวเลือก 3 ตัวอย่างตัวเลือก 3 ตัวอย่างตัวเลือก 3 ตัวอย่างตัวเลือก 3',
        'ตัวอย่างตัวเลือก 4 ตัวอย่างตัวเลือก 4 ตัวอย่างตัวเลือก 4 ตัวอย่างตัวเลือก 4 ตัวอย่างตัวเลือก 4',
        'ตัวอย่างตัวเลือก 5 ตัวอย่างตัวเลือก 5 ตัวอย่างตัวเลือก 5 ตัวอย่างตัวเลือก 5 ตัวอย่างตัวเลือก 5',
      ],
      correctAnswer: 3,
    ),
    QuestionModel(
      no: 3,
      question: '3 + 4 = ?',
      choice: ['5', '6', '7', '8', '9'],
      correctAnswer: 3,
    ),
    QuestionModel(
      no: 3,
      question: 'คอมเพลสเซอร์มีหน้าที่อย่างไร',
      choice: [
        'มีหน้าที่ดูดสารทําความเย็นที่มีอุณหภูมิสูง ความดันสูง และอัดสารทําความเย็นที่มีอุณหภูมิสูง ความดันสูง',
        'มีหน้าที่ดูดสารทําความเย็นที่มีอุณหภูมิสูง ความดันต่ํา และอัดสารทําความเย็นที่มีอุณหภูมิต่ํา ความดันสูง',
        'มีหน้าที่ดูดสารทําความเย็นที่มีอุณหภูมิต่ํา ความดันต่ํา และอัดสารทําความเย็นที่มีอุณหภูมิสูง ความดันสูง ',
        'มีหน้าที่ดูดสารทําความเยนทมอณหภมตา ความดนสง และอดสารทาความเยนทมอณหภมสงความดนสง',
        'มหนาทดดสารทาความเยนทมอณหภมตา ความดนตา และอดสารทาความเยนทมอณหภมสงความดนตา'
      ],
      correctAnswer: 3,
    ),
  ];
}
